#Область ПрограммныйИнтерфейс

// ЗначениеВСтроку
// Преобразует переданное значение в строку
//
// Параметры:
//  Значение - Произвольный	 - значение для преобразования в строковое представление
//  ФорматнаяСтрока - Строка - формат получаемой строки для примитивных типов
//  Кешировать - Булево - признак необходимости кэширования результата
// 
// Возвращаемое значение:
//  Строка - результат преобразования значения
//
Функция ЗначениеВСтроку(Значение, ФорматнаяСтрока = "", Кешировать = Ложь) Экспорт
	
КонецФункции

// ЧислоИзОднойСистемыВДругую
// 	Возвращает представление числа, преобразованного из одной системы счисления в другую.
// 
// Параметры:
// 	ПредставлениеЧисла - Строка - представление числа.
// 					   - Число - Преобразуемое число
// 	ОснованиеЧисла - Число - основание системы счисления переданного представления числа (1-32).
// 	ОснованиеРезультата - Число - основание системы счисления результата (1-32).
// 	ДлинаРезультата - Число - количество символов в возвращаемом представлении, если результат меньшей длины - будет дополнен нулями слева.
// 	ТекстОшибки - Строка - в этот параметр будет помещен текст возникшей ошибки.
// 
// Возвращаемое значение:
// 	Строка - представление числа в требуемой системе счисления, "0" при ошибке.
Функция ЧислоИзОднойСистемыВДругую(ПредставлениеЧисла, ОснованиеЧисла, ОснованиеРезультата, ДлинаРезультата = 1, ТекстОшибки = "") Экспорт
	
КонецФункции

#КонецОбласти