#Область ПрограммныйИнтерфейс

// ПолучитьСтрокуИзКоллекцииПодстрок
//  Устаревший
//  Возвращает строку, полученную из массива элементов, списка значений или таблицы значений, разделенных символом разделителя
//
// Параметры:
//  Коллекция			 - ФиксированныйМассив, Массив, СписокЗначений, ТаблицаЗначений	 - коллекция элементов из 
//  	которых необходимо получить строку
//  Разделитель			 - Строка														 - любой набор символов, 
//  	который будет использован как разделитель между элементами в строке
//  Колонки				 - Строка														 - Имена колонок таблицы 
//  	значений, разделенные ";" или "*" если необходимо вывести все колонки
//  ИгнорироватьОшибки	 - Булево														 - Если установлен в Истина, 
//  	то неверные имена колонок игнорируются, в противном случае будет выдана ошибка, содержащая неверные колонки
// 
// Возвращаемое значение:
//  Строка - строка, полученная из коллекции элементов, разделенных символом разделителя
//
Функция ПолучитьСтрокуИзКоллекцииПодстрок(Коллекция, Разделитель = ",", Колонки = Неопределено, ИгнорироватьОшибки = Ложь) Экспорт
	
КонецФункции

// ПолучитьСтрокуИзКоллекцииПодстрок
//  Устаревший
//  Возвращает строку, полученную из массива элементов, списка значений или таблицы значений, разделенных символом разделителя
//
// Параметры:
//  Коллекция			 - ФиксированныйМассив, Массив, СписокЗначений, ТаблицаЗначений	 - коллекция элементов из
//  	которых необходимо получить строку
//  Разделитель			 - Строка														 - любой набор символов,
//  	который будет использован как разделитель между элементами в строке
//  Колонки				 - Строка														 - Имена колонок таблицы
//  	значений, разделенные ";" или "*" если необходимо вывести все колонки
//  ИгнорироватьОшибки	 - Булево														 - Если установлен в Истина,
//  	то неверные имена колонок игнорируются, в противном случае будет выдана ошибка, содержащая неверные колонки
//
// Возвращаемое значение:
//  Строка - строка, полученная из коллекции элементов, разделенных символом разделителя
//
Функция ПолучитьСтрокуИзКоллекцииПодстрок2(Коллекция, Разделитель = ",", Колонки = Неопределено, ИгнорироватьОшибки = Ложь) Экспорт

КонецФункции

#КонецОбласти